In [11]:
import pandas as pd
import numpy as np

In [12]:
from env import host, user, password
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [13]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [ ]:
#5a Intentionally make a typo in the database url. 
# What kind of error message do you see?
# OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'germain_1456'@'%' to database 'employeess'")
# (Background on this error at: http://sqlalche.me/e/14/e3q8)

In [ ]:
#5b Intentionally make an error in your SQL query. 
# What does the error message look like?
# ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.employeess' doesn't exist")
# [SQL: SELECT * FROM employeess LIMIT 5 OFFSET 50]
# (Background on this error at: http://sqlalche.me/e/14/f405)

In [15]:
emp_sql = '''
SELECT *
FROM employees
'''
employees = pd.read_sql(emp_sql, url)
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [20]:
#7 How many rows and columns do you have in each DataFrame?
employees.shape

(300024, 6)

In [25]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [16]:
titles_sql = '''
SELECT *
FROM titles'''
titles = pd.read_sql(titles_sql, url)
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [21]:
#7 How many rows and columns do you have in each DataFrame?
titles.shape

(443308, 4)

In [26]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [28]:
#9 How many unique titles are in the titles DataFrame?
titles.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

In [29]:
#10 What is the oldest date in the to_date column?
titles.to_date.min()

datetime.date(1985, 3, 1)

In [32]:
titles.to_date.sort_values()

16064     1985-03-01
406358    1985-03-11
346216    1985-03-20
35527     1985-03-23
277603    1985-04-17
             ...
191714    9999-01-01
191712    9999-01-01
191707    9999-01-01
191723    9999-01-01
443307    9999-01-01
Name: to_date, Length: 443308, dtype: object

In [50]:
#11 What is the most recent date in the to_date column?
non_current_to_date_sql = '''
SELECT *
FROM titles
WHERE to_date < '9999-01-01' '''
non_current = pd.read_sql(non_current_to_date_sql, url)
non_current

        emp_no               title   from_date     to_date
0        10004            Engineer  1986-12-01  1995-12-01
1        10005               Staff  1989-09-12  1996-09-12
2        10007               Staff  1989-02-10  1996-02-11
3        10008  Assistant Engineer  1998-03-11  2000-07-31
4        10009  Assistant Engineer  1985-02-18  1990-02-18
...        ...                 ...         ...         ...
203179  499992               Staff  1987-05-10  1992-05-09
203180  499994            Engineer  1993-02-22  1993-10-27
203181  499996            Engineer  1996-05-13  2002-05-13
203182  499997            Engineer  1987-08-30  1992-08-29
203183  499998               Staff  1993-12-27  1998-12-27

[203184 rows x 4 columns]

In [51]:
non_current.to_date.max()

datetime.date(2002, 8, 1)

In [54]:
non_current.to_date.sort_values()

7303      1985-03-01
186225    1985-03-11
158686    1985-03-20
16209     1985-03-23
127199    1985-04-17
             ...
95874     2002-08-01
65708     2002-08-01
119779    2002-08-01
108052    2002-08-01
167151    2002-08-01
Name: to_date, Length: 203184, dtype: object